results/rabbit/stage-50/payload-heavy/1000VUs/repeat-1/1000vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rabbit/rabbitTest.js
        output: json (./results/rabbit/stage-50/payload-heavy/1000VUs/repeat-1/1000vus.json)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 587 complete and 0 interrupted iterations
default   [   2% ] 1000 VUs  0m00.9s/1m0s

running (0m01.9s), 1000/1000 VUs, 1554 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  0m01.9s/1m0s

running (0m02.9s), 1000/1000 VUs, 2515 complete and 0 interrupted iterations
default   [   5% ] 1000 VUs  0m02.9s/1m0s

running (0m03.9s), 1000/1000 VUs, 3483 complete and 0 interrupted iterations
default   [   7% ] 1000 VUs  0m03.9s/1m0s

running (0m04.9s), 1000/1000 VUs, 4443 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  0m04.9s/1m0s

running (0m05.9s), 1000/1000 VUs, 5406 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  0m05.9s/1m0s

running (0m06.9s), 1000/1000 VUs, 6350 complete and 0 interrupted iterations
default   [  12% ] 1000 VUs  0m06.9s/1m0s

running (0m07.9s), 1000/1000 VUs, 7315 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  0m07.9s/1m0s

running (0m08.9s), 1000/1000 VUs, 8263 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  0m08.9s/1m0s

running (0m09.9s), 1000/1000 VUs, 9235 complete and 0 interrupted iterations
default   [  17% ] 1000 VUs  0m09.9s/1m0s

running (0m10.9s), 1000/1000 VUs, 10213 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  0m10.9s/1m0s

running (0m11.9s), 1000/1000 VUs, 11167 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  0m11.9s/1m0s

running (0m12.9s), 1000/1000 VUs, 12137 complete and 0 interrupted iterations
default   [  22% ] 1000 VUs  0m12.9s/1m0s

running (0m13.9s), 1000/1000 VUs, 13091 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  0m13.9s/1m0s

running (0m14.9s), 1000/1000 VUs, 14051 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  0m14.9s/1m0s

running (0m15.9s), 1000/1000 VUs, 15037 complete and 0 interrupted iterations
default   [  27% ] 1000 VUs  0m15.9s/1m0s

running (0m16.9s), 1000/1000 VUs, 15991 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  0m16.9s/1m0s

running (0m17.9s), 1000/1000 VUs, 16949 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  0m17.9s/1m0s

running (0m17.9s), 1000/1000 VUs, 17917 complete and 0 interrupted iterations
default   [  32% ] 1000 VUs  0m18.9s/1m0s

running (0m18.9s), 1000/1000 VUs, 18867 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  0m19.9s/1m0s

running (0m19.9s), 1000/1000 VUs, 19857 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  0m20.9s/1m0s

running (0m20.9s), 1000/1000 VUs, 20809 complete and 0 interrupted iterations
default   [  37% ] 1000 VUs  0m21.9s/1m0s

running (0m21.9s), 1000/1000 VUs, 21763 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  0m22.9s/1m0s

running (0m22.9s), 1000/1000 VUs, 22720 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  0m23.9s/1m0s

running (0m23.9s), 1000/1000 VUs, 23694 complete and 0 interrupted iterations
default   [  42% ] 1000 VUs  0m24.9s/1m0s

running (0m24.9s), 1000/1000 VUs, 24650 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  0m25.9s/1m0s

running (0m25.9s), 1000/1000 VUs, 25590 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  0m26.9s/1m0s

running (0m26.9s), 1000/1000 VUs, 26564 complete and 0 interrupted iterations
default   [  47% ] 1000 VUs  0m27.9s/1m0s

running (0m27.9s), 1000/1000 VUs, 27536 complete and 0 interrupted iterations
default   [  48% ] 1000 VUs  0m28.9s/1m0s

running (0m28.9s), 1000/1000 VUs, 28491 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  0m29.9s/1m0s

running (0m29.9s), 1000/1000 VUs, 29477 complete and 0 interrupted iterations
default   [  52% ] 1000 VUs  0m30.9s/1m0s

running (0m30.9s), 1000/1000 VUs, 30417 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  0m31.9s/1m0s

running (0m31.9s), 1000/1000 VUs, 31404 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  0m32.9s/1m0s

running (0m32.9s), 1000/1000 VUs, 32347 complete and 0 interrupted iterations
default   [  57% ] 1000 VUs  0m33.9s/1m0s

running (0m33.9s), 1000/1000 VUs, 33325 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  0m34.9s/1m0s

running (0m34.9s), 1000/1000 VUs, 34275 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  0m35.9s/1m0s

running (0m35.9s), 1000/1000 VUs, 35275 complete and 0 interrupted iterations
default   [  62% ] 1000 VUs  0m36.9s/1m0s

running (0m36.9s), 1000/1000 VUs, 36201 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  0m37.9s/1m0s

running (0m37.9s), 1000/1000 VUs, 37186 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  0m38.9s/1m0s

running (0m38.9s), 1000/1000 VUs, 38127 complete and 0 interrupted iterations
default   [  67% ] 1000 VUs  0m39.9s/1m0s

running (0m39.9s), 1000/1000 VUs, 39101 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  0m40.9s/1m0s

running (0m40.9s), 1000/1000 VUs, 40050 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  0m41.9s/1m0s

running (0m41.9s), 1000/1000 VUs, 41048 complete and 0 interrupted iterations
default   [  72% ] 1000 VUs  0m42.9s/1m0s

running (0m42.9s), 1000/1000 VUs, 42009 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  0m43.9s/1m0s

running (0m43.9s), 1000/1000 VUs, 42981 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  0m44.9s/1m0s

running (0m44.9s), 1000/1000 VUs, 43934 complete and 0 interrupted iterations
default   [  77% ] 1000 VUs  0m45.9s/1m0s

running (0m45.9s), 1000/1000 VUs, 44913 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  0m46.9s/1m0s

running (0m46.9s), 1000/1000 VUs, 45864 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  0m47.9s/1m0s

running (0m46.8s), 1000/1000 VUs, 46833 complete and 0 interrupted iterations
default   [  82% ] 1000 VUs  0m48.9s/1m0s

running (0m47.8s), 1000/1000 VUs, 47797 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  0m49.9s/1m0s

running (0m48.8s), 1000/1000 VUs, 48739 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  0m50.9s/1m0s

running (0m49.8s), 1000/1000 VUs, 49719 complete and 0 interrupted iterations
default   [  87% ] 1000 VUs  0m51.9s/1m0s

running (0m50.8s), 1000/1000 VUs, 50642 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  0m52.9s/1m0s

running (0m51.8s), 1000/1000 VUs, 51597 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  0m53.9s/1m0s

running (0m52.8s), 1000/1000 VUs, 52577 complete and 0 interrupted iterations
default   [  92% ] 1000 VUs  0m54.9s/1m0s

running (0m53.8s), 1000/1000 VUs, 53528 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  0m55.9s/1m0s

running (0m54.8s), 1000/1000 VUs, 54496 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  0m56.9s/1m0s

running (0m55.8s), 1000/1000 VUs, 55455 complete and 0 interrupted iterations
default   [  97% ] 1000 VUs  0m57.9s/1m0s

running (0m56.8s), 1000/1000 VUs, 56430 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  0m58.9s/1m0s

running (0m57.8s), 1000/1000 VUs, 57371 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  0m59.9s/1m0s

running (0m58.8s), 0074/1000 VUs, 58348 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 92.93% 54295 out of 58422
    benchmark_total_failure_rate...: 92.93% 54295 out of 58422

    HTTP
    http_req_duration..............: avg=997.85ms min=54.69µs med=1.03s max=2.24s p(90)=1.06s p(95)=1.06s
      { expected_response:true }...: avg=997.85ms min=54.69µs med=1.03s max=2.24s p(90)=1.06s p(95)=1.06s
    http_req_failed................: 0.00%  0 out of 58422
    http_reqs......................: 58422  991.893815/s

    EXECUTION
    iteration_duration.............: avg=1.03s    min=255.3ms med=1.03s max=2.24s p(90)=1.06s p(95)=1.06s
    iterations.....................: 58422  991.893815/s
    vus............................: 74     min=74             max=1000
    vus_max........................: 1000   min=1000           max=1000

    NETWORK
    data_received..................: 15 MB  247 kB/s
    data_sent......................: 1.9 GB 33 MB/s



running (0m58.9s), 0000/1000 VUs, 58422 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  1m0s